1. to understand how much AirBNB homes are earning in certain time frames and areas. 
2. You can compare rates between the two cities, 
3. or try to understand if there is anything about the properties that helps you predict price. 
4. Can you find negative and positive reviews based on text? 

This dataset requires a number of skills beyond those shown thus far in the course, 
but if you would like a challenge, this will certainly test your ability to work with messy, real world data.

In [42]:
import pandas as pd

In [61]:
df_listings = pd.read_csv('boston\listings.csv', sep=',')
df_calendar = pd.read_csv('boston\calendar.csv', sep=',')

In [51]:
df_listings.head(2)

,id,listing_url,scrape_id,last_scraped,name,summary,space,description,experiences_offered,neighborhood_overview,...,review_scores_value,requires_license,license,jurisdiction_names,instant_bookable,cancellation_policy,require_guest_profile_picture,require_guest_phone_verification,calculated_host_listings_count,reviews_per_month
0,12147973,https://www.airbnb.com/rooms/12147973,20160906204935,2016-09-07,Sunny Bungalow in the City,"Cozy, sunny, family home. Master bedroom high...",The house has an open and cozy feel at the sam...,"Cozy, sunny, family home. Master bedroom high...",none,"Roslindale is quiet, convenient and friendly. ...",...,NaN,f,NaN,NaN,f,moderate,f,f,1,NaN
1,3075044,https://www.airbnb.com/rooms/3075044,20160906204935,2016-09-07,Charming room in pet friendly apt,Charming and quiet room in a second floor 1910...,Small but cozy and quite room with a full size...,Charming and quiet room in a second floor 1910...,none,"The room is in Roslindale, a diverse and prima...",...,9.0,f,NaN,NaN,t,moderate,f,f,1,1.3

In [4]:
df_listings.shape

(3585, 95)

In [53]:
df_calendar.head()

   listing_id        date available price
0    12147973  2017-09-05         f   NaN
1    12147973  2017-09-04         f   NaN
2    12147973  2017-09-03         f   NaN
3    12147973  2017-09-02         f   NaN
4    12147973  2017-09-01         f   NaN

In [54]:
df_calendar.dtypes

listing_id     int64
date          object
available     object
price         object
dtype: object

In [8]:
len(df_calendar.listing_id.unique().tolist())

3585

In [9]:
len(df_listings.id.unique().tolist())

3585

In [56]:
len(df_calendar['date'].unique())

365

In [11]:
df_calendar.price.isnull().sum()

665853

In [12]:
df_calendar.price.notnull().sum()

643037

In [57]:
# does not work
df_calendar = df_calendar.price.replace(to_replace='$', value='', inplace=True)
df_calendar.head()

In [24]:
df_calendar[df_calendar['listing_id'] == 6976]

      listing_id        date available   price
730         6976  2017-05-12         t  $65.00
731         6976  2017-05-11         t  $65.00
732         6976  2017-05-10         t  $65.00
733         6976  2017-05-09         t  $65.00
734         6976  2017-05-08         t  $65.00
...          ...         ...       ...     ...
1090        6976  2016-09-10         t  $65.00
1091        6976  2016-09-09         f     NaN
1092        6976  2016-09-08         f     NaN
1093        6976  2016-09-07         f     NaN
1094        6976  2016-09-06         f     NaN

[365 rows x 4 columns]

In [62]:
df_calendar.replace('[$,]', '', regex=True, inplace=True)

In [63]:
df_calendar[df_calendar['listing_id'] == 6976]

      listing_id        date available  price
730         6976  2017-05-12         t  65.00
731         6976  2017-05-11         t  65.00
732         6976  2017-05-10         t  65.00
733         6976  2017-05-09         t  65.00
734         6976  2017-05-08         t  65.00
...          ...         ...       ...    ...
1090        6976  2016-09-10         t  65.00
1091        6976  2016-09-09         f    NaN
1092        6976  2016-09-08         f    NaN
1093        6976  2016-09-07         f    NaN
1094        6976  2016-09-06         f    NaN

[365 rows x 4 columns]

In [65]:
df_calendar.dropna(axis=0, inplace=True)

In [67]:
df_calendar

         listing_id        date available  price
365         3075044  2017-08-22         t  65.00
366         3075044  2017-08-21         t  65.00
367         3075044  2017-08-20         t  65.00
368         3075044  2017-08-19         t  75.00
369         3075044  2017-08-18         t  75.00
...             ...         ...       ...    ...
1308875    14504422  2016-09-20         t  62.00
1308876    14504422  2016-09-19         t  62.00
1308877    14504422  2016-09-18         t  62.00
1308878    14504422  2016-09-17         t  62.00
1308879    14504422  2016-09-16         t  62.00

[643037 rows x 4 columns]

In [70]:
df_calendar.dtypes

listing_id     int64
date          object
available     object
price         object
dtype: object

In [71]:
df_calendar.price = df_calendar.price.astype(float)

In [72]:
df_calendar.dtypes

listing_id      int64
date           object
available      object
price         float64
dtype: object